[
  {
    "title": "Dig Deeper: What Archaeology Can Teach Us About Empathy &#38; Compassion",
    "url": "https://www.stepituphr.com/post/dig-deeper-what-archaeology-can-teach-us-about-empathy-compassion",
    "published": "Thu, 31 Jul 2025 08:44:58 GMT",
    "summary": "Great leaders don’t just manage, they discover. In this blog, we explore how leading with empathy and compassion - like an archaeologist - helps you uncover what’s really going on beneath the surface. Dig deeper. Lead with care.",
    "full_content": "Dig Deeper: What Archaeology Can Teach Us About Empathy & Compassion\nDebra Corey\n2 days ago\n3 min read\nIn the rush of daily deadlines, back-to-back meetings, and overflowing to-do lists, it’s easy to focus only on what’s visible - the behaviours, the performance, the things right in front of us.\nBut what if the key to stronger leadership and deeper connection with your people lies beneath the surface?\nIn this edition, we’re digging into two powerful building blocks from our Great Boss Building Block Model™ - Empathy and Compassion - and exploring how they can transform how we lead. And we’ll do it through an unusual but meaningful lens: the world of the archaeologist.\nJust like archaeologists, great leaders take time to uncover what’s hidden, understand the full story, and act with care.\n4 Ways to Lead Like an Archaeologist\n1. Curiosity Without Judgment\nArchaeologists approach every dig with curiosity, not assumptions. They seek to understand how people lived - not to judge or label it as right or wrong.\nLeadership takeaway:\nEmpathy starts with curiosity. Ask, “What’s behind this behaviour?” instead of rushing to conclusions. Suspend judgment and lean into understanding.\n2. Uncover Hidden Layers\nThe best archaeologists don’t go in with heavy tools. They use delicate brushes and work with care, revealing layers of meaning and context without causing harm.\nLeadership takeaway:\nEmpathy and compassion mean going deeper. Don’t just react to surface actions and behaviours - take time to uncover what someone might be feeling or experiencing underneath. Respond with patience and care.\n3. Piece Together the Bigger Picture\nFinds are rarely whole. Archaeologists often work with fragments, slowly piecing them together to form the bigger artifact or story.\nLeadership takeaway:\nPeople are the same. To truly support someone, you have to connect the dots - history, stressors, context. Compassionate leaders look beyond isolated moments to see the full person and situation.\n4. Respect Different Cultures and Stories\nArchaeologists don’t impose their worldview. They approach different cultures and time periods with respect, seeking to understand stories on their own terms.\nLeadership takeaway:\nAs Brené Brown says, “Empathy has no script. There is no right way or wrong way to do it. It’s simply listening, holding space, withholding judgment.” And crucially, she also says we can never fully get into someone else’s shoes - but we can try to understand what it’s like to walk in them.\nCompassionate leaders honour those differences and respond in ways that acknowledge who people truly are, not acting based on what we assume they want and need. They don’t need to have lived the same experience to treat it with care, dignity, and support.\nYour Leadership Reflection\nNext time you face a moment that calls for empathy or compassion, pause and ask: What might I discover if I led like an archaeologist - with curiosity, care, and the desire to truly understand?\nBe the archaeologist of someone’s experience. Dig deeper. Uncover the truth. Treat every layer with care.\nDIY Leadership Development Tool\nDo you or your leaders need a boost when it comes to leading with empathy and compassion?\nYou’re not alone. Even experienced managers can struggle to lead with empathy and compassion - especially under pressure. That’s why we created our\nEmpathy & Compassion Compassion Card Challenge,\npart of our new DIY Leadership Development tools.\nIt’s\npractical\n,\npowerful\n, and\nreasonably priced\n- making it accessible for any business or leader ready to grow.\nThis pair-based activity puts participants in real-world scenarios where they practise making thoughtful, effective choices - building the confidence and capability to lead with empathy, act with compassion, and make a real impact.\n👉 Click\nhere\nto learn more and start building this essential leadership skill today.\nTags:\nLeadership\nEmpathy\nCompassion\nLeadership"
  },
  {
    "title": "The $8.8 Trillion Disengagement Problem - and 2 Things to Do About It",
    "url": "https://www.stepituphr.com/post/the-8-8-trillion-disengagement-problem-and-2-things-to-do-about-it",
    "published": "Wed, 30 Jul 2025 09:27:16 GMT",
    "summary": "Global employee engagement is stalling, and leaders are in the spotlight. In this blog, I explore why disengagement is costing the world $8.8 trillion, and what leaders can do about it.",
    "full_content": "The $8.8 Trillion Disengagement Problem - and 2 Things to Do About It\nDebra Corey\n3 days ago\n3 min read\nWhen my book on employee engagement, Build It: The Rebel Playbook for Employee Engagement, was released in 2018, Gallup reported that global engagement was sitting at a not-so-stellar 18%.\nFast forward to Gallup’s most recent 2024 report, and it’s up slightly to 21%. Progress? Sort of. But here’s the twist: that number is actually down from the year before, the first decline in a decade. The slow climb has stalled. And the big question is: what’s going wrong?\nGallup isn’t shy about pointing fingers. This time, they’re aiming squarely at managers, whose own engagement has dropped from 30% to 27% globally. They say that dip is dragging teams down with it. Seems a little harsh, doesn’t it?\nBut let’s be honest: it’s no surprise. Being a manager today is tough. Expectations are sky-high. Change is relentless. And employees are more vocal about what they want, and don’t want, from their work experience.\nMany managers are feeling overwhelmed, undertrained, and under-supported. Something had to give. And it has. The cost? A staggering $8.8 trillion a year. That’s 9% of global GDP, lost to disengagement.\nSo what can you do? You can’t fix the global economy, but there are two steps to help yourself and engagement in general move in the right direction.\nStep One: Put on your engagement oxygen mask first\nLast year, I learned (the hard way) what happens when you forget to put your own oxygen mask on first. Spoiler: it ended with me being in a hospital bed for a week. Not exactly part of my leadership development plan. If you’re running on empty, you can’t show up as the leader your team needs. So be honest with yourself and:\nSet some boundaries. Yes, you’re allowed to block time for deep work, or a proper, uninterrupted lunch.\nGet curious. What’s fuelling you? What’s draining you? Awareness is absolutely critical to your engagement and wellbeing.\nRedefine success. What does growth really look like for you now and in the future? Redefine it on your own terms.\nSay no more often. Protect your “yes” for the stuff that really matters.\nThe best leaders know the secret: it starts with you. If you’re not engaged, energised, or clear on what matters-how can you expect your team to be? When you get it right with yourself first, you give your people a much better shot at thriving, too.\nStep Two: Do engagement the ‘smart’ way\nNow that you’re recharged (or at least refilling your cup), it’s time to engage your team - but let’s be smart about it. Think of it like using a smart device. You don’t manually turn every light on in your house anymore, you tap a button or let automation handle it. Less energy, more efficiency.\nThe same goes for leading your people. You don’t need to do it all or throw everything at the wall to see what sticks. You just need to know what your people need, and deliver the right support at the right time.\nThat might mean:\nReally listening to someone who’s struggling.\nOffering a little praise when it’s overdue.\nOr stepping into coach mode when someone’s stuck.\nIt’s not about constant hustle. It’s about leading with intention, so you’re working smarter, not harder.And the best part? When you get this right, engagement becomes a lot less of a grind, and a lot more of a natural flow.\nAsk yourself:\nDo I really know what’s motivating (or de-motivating) each person on my team?\nWhat’s one simple thing I could do this week to boost engagement?\nWhich of the Great Boss Building Blocks™ could I use right now to unlock more energy, connection, or clarity?\nThe bottom line?\nNo, you can’t fix global engagement single-handedly. But you can shape it-block by block, person by person, starting with yourself. So this week, reflect on:\nWhat do I really know about my team’s engagement-beyond the last engagement survey?\nWhat am I doing to protect and improve my own engagement?\nWhich building blocks will help me lead just a little bit better this week?\nLet’s start fixing the problem together!\nTags:\nDevelopment\nLeadership\nLeadership"
  },
  {
    "title": "Four Tools to Help Your People Learn and Grow: Unlocking the Power of the Learning Wheel",
    "url": "https://www.stepituphr.com/post/four-tools-to-help-your-people-learn-and-grow-unlocking-the-power-of-the-learning-wheel",
    "published": "Thu, 24 Jul 2025 06:20:11 GMT",
    "summary": "Explore the Learning Wheel, the four elements that leaders can use to help their people grow and learn. These include feedback, appreciation, development and coaching.",
    "full_content": "Four Tools to Help Your People Learn and Grow: Unlocking the Power of the Learning Wheel\nDebra Corey\nJul 24\n3 min read\nIf you think about it, learning and growth are a lot like a wheel.\nA wheel only works when all of its spokes are in place - connected, balanced, and working together. If one spoke is missing or weak, the wheel wobbles or breaks. But when each spoke is strong and aligned, the wheel moves forward smoothly, building momentum and making a lasting impact.\nThe same is true for how leaders help their people grow and learn.\nWe call this the Learning Wheel - made up of four essential spokes:\nfeedback, appreciation, development and coaching\n. Individually, each one matters and makes a real difference. But together, they create a dynamic force that fuels growth, deepens trust, drives engagement, and leaves a lasting impact across teams and organisations.\nIn this blog, we’re focusing on these four powerful leadership tools (or what we call building blocks) - why they matter, and how to use them both individually and collectively.\nBecause great leadership isn’t about picking a single tool and sticking with it. It’s about knowing which tool to use, when to use it, and how to adapt it.\nThe 4 Spokes of the Learning Wheel\nEach spoke of this wheel plays a critical and distinct role. Think of them as complementary tools - each bringing something unique to how we lead, support, and develop others. Let’s explore each one:\nFeedback holds up a mirror 🪞\nIt helps people see what’s working (and what’s not). It provides clarity and direction, helping them correct their course. Without it, people are left guessing - which undermines both performance and confidence.\nAppreciation shines a light 🔦\nIt helps people feel valued and motivated, shining a light on their actions, behaviours, and contributions. It reinforces positive behaviours and builds emotional commitment to the team and organisation. Without appreciation, people can feel invisible - even when doing great work.\nDevelopment builds the foundation 🧱\nIt provides structured learning through courses, books, and other formal opportunities that expand knowledge and deepen skills. Without ongoing development, employees can stagnate, falling behind in fast-changing environments.\nCoaching opens a window 🪟\nIt creates space for people to reflect, problem-solve, and build ownership of their growth. Coaching strengthens critical thinking and long-term capability - something feedback alone can’t do.\nKnowing when to use each\nOne size won’t fit all. People's needs vary not only by situation but by personality, confidence, and style. As a leader, it’s important to know what your employee needs - right now, in the moment, in the situation.\nFor example, in one of our recent workshop sessions, a leader shared this insight:\n\"I realised I’d been giving a team member lots of feedback because I thought it would help. But what they actually needed was coaching - they needed space to build their own confidence. The more I ‘told’ them, the more hesitant they became. Switching to coaching helped them step up and grow.\"\nHere are four scenarios to illustrate this point:\nScenario 1: Your employee is unclear about expectations or unaware of an issue.\n→ Start with feedback.\nWhy? People can’t improve what they can’t see. Clear, timely feedback helps them understand what’s expected and where they currently stand.\nScenario 2: Your employee is stuck, unsure how to move forward, or needs to build confidence.\n→ Lean into coaching.\nWhy? Sometimes people don’t need more direction - they need space to think, reflect, and take ownership of the path forward. Coaching builds confidence and capability far beyond the immediate task.\nScenario 3: Your employee is making great progress or showing effort you want to reinforce.\n→ Offer appreciation.\nWhy? People need to feel seen and valued, not just corrected. Appreciation fuels motivation and helps people understand which behaviours and contributions are valued by the team and organisation.\nScenario 4: Your employee is eager to grow or needs to build new skills for future opportunities.\n→ Provide development opportunities.\nWhy? While feedback, coaching, and appreciation drive day-to-day performance and engagement, structured learning builds deeper expertise and broadens horizons. Development sustains long-term growth and prepares employees for what’s next.\nFinal Thought\nA car can’t drive forward smoothly without well-balanced wheels, and the same is true for learning and growth. When feedback, appreciation, coaching, and development are all in play - used in the right way, at the right time - the wheel turns easily, building momentum and helping people move forward with confidence.\nThat’s the power of the Learning Wheel - keeping growth on track and employees moving forward with confidence and purpose.\nWe love helping leaders learn and grow!\nWe design and deliver practical, engaging workshops on these four key topics, as well as other leadership building blocks outlined in our model.\nIf you’d like to explore how we can support you and your leadership team, we’d love to chat. Get in touch at debra.corey@stepituphr.\nTags:\nAppreciation\nDevelopment\nLearning\nFeedback\nCoaching\nLeadership"
  },
  {
    "title": "Which Bad Boss Persona Are You Wearing Today?",
    "url": "https://www.stepituphr.com/post/which-bad-boss-persona-are-you-wearing-today",
    "published": "Wed, 18 Jun 2025 07:23:33 GMT",
    "summary": "99.6% of people say they’ve had a bad boss . . . . which statistically means that we’ve all probably BEEN one too (Yep, even you!). In most cases it’s unintentional, we slip into what we call bad boss personas. In this blog we share 4 steps to help you step out of a bad Boss persona.",
    "full_content": "Which Bad Boss Persona Are You Wearing Today?\nDebra Corey\nJun 18\n3 min read\nLet’s be honest, most of us can recall a time when we worked for a bad boss. And according to the research we conducted for our book, we’re not alone:\n99.6% of people said they’ve had one\n.\nBut here’s the uncomfortable flip side: If nearly all of us have\nhad\na bad boss... it also means that nearly all of us have\nbeen\none, too - even if just for a moment.\nBecause for most of us, being a “bad boss” isn’t about malicious intent or toxic traits. We don’t wake up and say, “Today, I’m going to micromanage, avoid feedback, or emotionally vanish from my team.”\nNo, what actually happens is that we unintentionally start wearing what we call\nbad boss personas\n.\nSo instead of denial or defensiveness, let’s do something more powerful - what we encourage in our leadership workshops:\nLet’s notice them. Understand them. And then… do something about them.\n4 Steps to Help You Step Out of a Bad Boss Persona\n1. Name It to Tame It\nWe’re not ones for putting labels on people - after all, it often stifles growth and sparks resistance. That’s why we’ve put together the 10 most common \"bad boss\" personas. The goal? To help leaders recognise when things are slipping and pinpoint what's going wrong. Because let’s face it, if we can’t name the behaviour, we can’t change it.\nAnd just to be clear, these personas aren’t about labeling people; they’re about identifying the behaviours that are causing the issues.\nTip:\nTake a few minutes to familiarise yourself with the personas. What do they look like in action? Which ones do you slip into under pressure? Haven’t taken our free and confidential self-assessment yet?\nHere’s the link.\nWe call this the awareness and acceptance steps - knowing they exist, so you can catch yourself in the act and course correct.\n2. Own It Out Loud\nIt’s one thing to spot a bad boss persona - it’s another to\nown\nit.\nNo\n, we’re not saying you need to wear a name tag or t-shirt that says “Micromanager in Action” (although now that we think about it, that could be fun). But we\nare\nsaying that acknowledging it - out loud - can be a leadership superpower.\nReal-life example:\nI’ve shared before how my alter ego “Debby” would make appearances when I was wearing the Avoider, Hoarder, or Coercer personas. I’d jokingly say to my team, “Debby’s in the office - enter at your own risk.” Far from perfect, but it gave my team language, humour, and most importantly, protection from my unhelpful behaviours while I worked on changing them.\nBottom line: Own your persona. You’ll build trust, create psychological safety, and model humility in action.\n3. Ask: What’s Really Driving It?\nTime to channel your inner detective. When you notice a persona showing up, dig a little deeper:\nWhat’s happening around me that could be causing this? (External triggers)\nWhat am I feeling right now - fear, doubt, pressure, etc? (Internal triggers)\nIs there a pattern here?\nIs this response connected to something my employee said or did?\nWhat’s the story I’m telling myself at this moment?\nBad boss behaviours are often protective strategies - they show up when something deeper is being challenged. Understanding\nwhy\nis the key to shifting behaviour long-term.\n4. Flip It: What to Do Next Time\nMistakes and slip-ups are human. What matters most is what you do next. Once the moment has passed, take a breath, reflect, and ask:\nWhat would my\ngreat boss\nself have done differently?\nWhat skills, support, or mindset would I need to respond better next time?\nWhat’s one practical thing I can do to step\nout\nof this persona and into a more effective leadership behaviour?\nExample:\nIf you wore the Micromanager persona today, ask:\nWhat was I afraid would happen if I let go?\nDid my team need more clarity or support - not more control?\nThen flip it: give clearer direction next time, delegate with confidence, or invest in building the skills your team needs to thrive.\nAnd Finally…\nThis isn’t about perfection. It’s about self-awareness, acceptance, action, honesty, and growth. The best leaders don’t pretend they never wear a bad boss persona - they just make a conscious effort not to wear it for too long. And when they do? They recognise it, own it, and\nstep it up\n.\nWant to know which bad boss persona you wear most often?\nTake our free, confidential self-assessment:\nClick here to get started.\nReady to take it further with your leadership team?\nContact us as we'd love to deliver our innovative and effective leadership workshops to your team.\nLeadership"
  },
  {
    "title": "Your Leadership Shadow: Are You Casting the Right One?",
    "url": "https://www.stepituphr.com/post/your-leadership-shadow-are-you-casting-the-right-one",
    "published": "Wed, 18 Jun 2025 07:09:07 GMT",
    "summary": "Leadership isn’t just about what you say or do - it’s about the shadow you cast. One that influences your team today, and another that lingers, shaping future leaders long after you’re gone. Are you casting the right shadow?",
    "full_content": "Your Leadership Shadow: Are You Casting the Right One?\nDebra Corey\nJun 18\n4 min read\nYou know you influence your people - but have you ever considered the eerie presence of your shadow? \"My what?\" you might be thinking. Trust us, we had the same reaction when we first stumbled upon the term while researching our book. But the deeper we dug, the more unsettling and eye-opening it became. It unearthed memories we couldn’t ignore. Some were uplifting, moments of true inspiration. Others? Let’s just say they serve as cautionary tales - the kind that linger like whispers in the dark.\nThe two sides of your leadership shadow\nWhen reflecting on your leadership shadow, it’s crucial to consider it in two ways, both equally important. By doing this, can you be more intentional about the shadow you cast in both directions.\nThe Shadow You Cast on Your Team\nYour actions, values, behaviors and even what you prioritize and reward shape the culture, performance, and attitudes of your people - whether you realize it or not. It’s like when your child says or does something that makes you stop and think, Wait… do I really do that? And then reality hits - you do, and they’ve simply learned by watching you.\nThe Shadow You Leave on Future Leaders\nWhether your people lead now or later, they’ll carry parts of your leadership style with them. Will they adopt your best qualities? Or will they work extra hard not to lead like you?\nWhen we interviewed people for our book, we heard this time and time again - many said they went out of their way not to duplicate the bad boss behaviors they’d experienced. Think about it - your leadership choices today shape the leaders of tomorrow.\n“A leader’s impact is like a shadow - always there, whether they realize it or not.”\nDoes Your Leadership Shadow Really Matter?\nOK, I get it, I have a shadow. But you may be wondering - is my shadow actually that big of a deal? Can it really impact my people and company that much? We could throw a bunch of stats at you to prove that, yes, it absolutely does - but where’s the fun in that? Instead, let’s dive into some real-life stories of leaders who left shadows worth following… and those whose shadows had their teams running for the exit.\nWell-Known Bosses Who Cast a Bad Shadow\nThese leaders are often remembered for toxic cultures, poor decision-making, or management styles that negatively impacted employees and business outcomes.\nElon Musk (Tesla, Twitter/X, SpaceX) The Shadow:\nMusk is a visionary but has also been accused of creating a high-pressure, fear-driven environment. Reports suggest he pushes employees to extremes, firing those who don't meet his expectations instantly, leading to stress, burnout, and instability.\nThe Impact:\nMass resignations, lawsuits from ex-employees, and reports of toxic workplace culture, especially at Twitter after mass layoffs.\nElizabeth Holmes (Theranos)The Shadow:\nHolmes sold a dream of revolutionary healthcare technology that didn’t exist, leading employees to work under deception, fear, and extreme pressure.\nThe Impact:\nThe downfall of Theranos resulted in lawsuits, criminal charges, and a massive loss of trust in leadership and Silicon Valley startups.\nHarvey Weinstein (Former Hollywood Producer)The Shadow:\nWeinstein’s leadership was built on fear, intimidation, and abuse, using his power to manipulate employees and actors.\nThe Impact:\nHis exposure sparked the\n#MeToo\nmovement, leading to legal consequences, and a massive industry reckoning on workplace abuse.\n“A bad boss is like a shadow at noon - short, ineffective, and disappears when things get tough.”\nWell-Known Bosses Who Cast a Good Shadow\nThese leaders are known for fostering trust, innovation, and engagement among their teams.\nJacinda Ardern (Former PM of New Zealand)The Shadow:\nKnown for her empathetic and decisive leadership, she prioritized kindness, communication, and well-being while leading the country through crises.\nThe Impact:\nShe gained immense trust and loyalty from both her team and the public, proving that leadership doesn’t have to be cutthroat to be effective.\nTony Hsieh (Former CEO, Zappos)The Shadow:\nHsieh revolutionized company culture by prioritizing employee happiness, customer service, and a unique, fun work environment.\nThe Impact:\nZappos became a gold standard for workplace culture, proving that happy employees drive business success.\nWarren Buffett (CEO, Berkshire Hathaway)The Shadow:\nBuffett leads with humility, long-term thinking, and trust in his employees, avoiding the flashy, egotistical CEO persona.\nThe Impact:\nHis company thrives without micromanagement, and he’s widely respected for ethical business practices.\n“Good leaders step into the light. Great leaders make sure others shine, too.”\nTo end on a positive and a call to action, here are three steps to take to be aware of your shadow:\nSelf-Reflection\n: Great leaders take a step back and regularly ‘look in the mirror’ to assess how they’re behaving, acting, and influencing their people. Do you like what you see, or do you need to take some ownership and responsibility to change the image?\nFeedback Loops\n: Great leaders aren’t afraid to go to their people for their honest feedback, providing valuable insights into how their shadow is perceived. Think of it like a more powerful mirror, having a clearer view and insights. Btw, we just introduced a fantastic 360-degree feedback tool that does this, click on this link to learn more about it.\nLook Around You\n: And finally, a sure fire way to know the impact of your leadership shadow is to look around you. Since your team’s behaviors, attitudes, and work habits are often a reflection of you - are you seeing the right ones or ones that make you pause?\nIn summary, keep in mind that your impact as a leader goes beyond the present - it shapes the future of your team and their teams to come. If you (or other managers in your organization) aren’t sure how your shadow shows up or what to do about it, we’re here to help.\nJoin us in conversations on\nLinkedIn\n, attend one of our\nworkshops\n, or catch us at\nconferences and in-house talks\n. And if you want to dive deeper, our book\nBad Bosses Ruin Lives\nis available on\nAmazon\n.\nLeadership"
  },
  {
    "title": "From Worst to First: How Wurzak Hotel Group Transformed Their Culture and Became an Employer of Choice",
    "url": "https://www.stepituphr.com/post/from-worst-to-first-how-wurzak-hotel-group-transformed-their-culture-and-became-an-employer-of-choi",
    "published": "Sun, 26 Jan 2025 20:45:58 GMT",
    "summary": "From 2.2 to 4.2 on Glassdoor! Wurzak Hotel Group’s culture transformation shows the power of intentionality, creativity and teamwork.",
    "full_content": "From Worst to First: How Wurzak Hotel Group Transformed Their Culture and Became an Employer of Choice\nDebra Corey\nJan 26\n3 min read\nUpdated:\nApr 12\nThe Wurzak Hotel Group has been on an incredible journey, one that took them from being a company with one of the lowest Glassdoor ratings (2.2) to becoming an Employer of Choice with a remarkable 4.2 rating. This transformation wasn’t by chance - it was the result of intentionality, creativity, and commitment to building a culture that team members could thrive in.\nAt the heart of this transformation was James Ferguson, who transitioned from being a General Manager at one of their hotels to leading culture efforts across the company. While he knew how to build a strong culture at one property, scaling that success across 10 hotels presented an entirely new challenge. This role - a first for the company - was created out of necessity, recognizing that culture would be a driving force for success.\nJames took on the challenge with enthusiasm, developing a plan built on eight foundational pillars that would drive the company’s culture forward. But having pillars alone wasn’t enough - they needed a plan to bring them to life and into action. Here’s how they did this, using a three-phase approach: Awareness, Education, and Activation.\nPhase 1: Awareness – Defining the Pillars\nWhen James stepped into the role, the pillars existed, but they had no definitions. The first step was to define what each pillar meant, creating a shared understanding across the organization.\nTo make these pillars visible, they created large posters with the pillars and their matching icons, placing them in the back-of-house areas at each hotel. They intentionally avoided overcomplicating the messaging, opting instead to build awareness through simplicity and consistency. The goal was clear - to move the pillars beyond abstract conversations and transform them into a visible, tangible part of the workplace, fully integrated and living and breathing within the organization.\nWurzak Hotel Group's Values\nPhase 2: Education – Bringing the Pillars to Life\nAwareness was just the start. Next came education - helping team members understand how the pillars applied to their day-to-day work. They did this by launching the ‘Pillars with Purpose Plan,’ a fun and experiential curriculum of huddle exercises designed to energize teams. These ten minute micro-learning sessions focused on a single pillar each day, guiding team members to Define, Discover, Develop, and Deploy it in action.\n“This helped take what was just a picture on the wall and turn it into a conversation and an education,” James shared. “It allowed people to better understand how the pillars connected to our day-to-day work.”\nPhase 3: Activation – Turning Words into Actions\nThe final phase was all about activation, ensuring the pillars weren’t just words on a wall but became part of the company’s DNA. One standout program was ‘Wurzak WOW,’ an on-the-spot recognition program celebrating team members for embodying the pillars. Leaders could hand out WOW cards by circling the specific pillar a team member had exemplified, explaining what caught their eye and why, and then the team member would place the WOW bucks in a recognition box.\nEvery Friday - dubbed ‘Fri-YAY’ - a winner was randomly selected and celebrated at each hotel, with names and stories shared in newsletters, luncheons, and quarterly business reviews. “It’s also a great way to get leaders out of their offices, actively looking for and recognizing the great work happening across our hotels,” James noted.\nWurzak Hotel Group WOW Program\nAnother example of an activation tool was the introduction of the ‘W’ hand symbol. Inspired by sports teams who use symbols as their rallying cry, James implemented this simple gesture to build community and unity across Wurzak’s team members. “It’s really caught on,” he said. “In fact, in every team photo, you’ll see people proudly throwing up the ‘W.’”\nI absolutely loved the idea of the ‘W’! So much so, that when I had the honor of presenting Wurzak with the Culture Pioneer Brand Award, I couldn’t resist asking everyone in the audience to flash the iconic ‘W’. It was a powerful moment to celebrate not just this simple yet impactful symbol, but also the tremendous work and achievements of the Wurzak team. Congratulations to them for this incredible achievement, and for showing us all that with the right mindset and effort, you can truly go from worst to first.\nJames Ferguson and Dr. Kelly Makino winning the award\nPlease contact us if you'd like to chat about how we can help you transform your culture, we'd love to help.\nCompany Values"
  },
  {
    "title": "Inspiring Your People Through Volcanoes",
    "url": "https://www.stepituphr.com/post/inspiring-your-people-through-volcanoes",
    "published": "Fri, 01 Nov 2024 00:00:00 GMT",
    "summary": "Inspiration is the invisible fuel that motivates and powers your people. Read how Blue Lagoon Iceland did this in the midst of volcanoes.",
    "full_content": "Inspiring Your People Through Volcanoes\nDebra Corey\nNov 1, 2024\n4 min read\nUpdated:\nApr 12\nInspiration is the invisible fuel that motivates and powers your people. It's the catalyst that transforms mundane tasks into meaningful endeavors, elevating the collective spirit and driving everyone toward a common goal. When a team is inspired, the atmosphere is electric – ideas flow freely, collaboration is effortless, and challenges are met with enthusiasm rather than dread.\nInspiration can be that magic ingredient that can propel work from mediocrity to excellence, and it's often the distinguishing factor between teams and companies that merely function and those that truly thrive and succeed.\nBut how can you inspire your people during challenging times? Great question, and one we'll be answering in this blog, sharing the story of how bosses at the Blue Lagoon Iceland inspired their people when dealing with the recent volcanoes. They didn’t just use one strategy—they used a combination of building blocks from our Great Boss Building Block model, and the result wasn’t just additive; it multiplied their effectiveness.\nAlthough all bosses won’t have to inspire in these situations, we can all agree that challenges and disasters come in different shapes and sizes, so it’s always best to be armed with as many inspirational tools as possible.\nSo let’s answer a few questions regarding Inspiration . . . . .\nWhy is inspiration important?\nHaving an inspired workforce is absolutely critical to your business for a variety of reasons.\nFirst, it can lead to higher levels of engagement and performance, as your people are more likely to be emotionally invested in their work and the company's success.\nNext, it can be a driving force behind innovation and unlocking creativity, as inspired people are more likely to think outside the box and challenge the status quo.\nFinally, inspiration can foster a positive work environment, as inspired teams are generally happier, more motivated, cohesive, and collaborative.\nAdd this all together, and your people will be more satisfied with their jobs, while your business will have lower turnover and be more successful.\nWhat’s a boss’s role?\nWhen we defined Inspiration previously, we explained it as an invisible fuel. For this reason, in our workshops, we encourage attendees to think of themselves as Inspiration Engineers or Mechanics. Picture yourself pumping inspiration fuel to and through your people to motivate and power them to perform and succeed. And to remind yourself how important your role is, picture one of your people in a situation where their car’s fuel gauge was on empty. Without you ‘filling them up’ with inspiration, they face a whole wrath of negative consequences.\nHow can bosses inspire their people?\nThere’s no one way to inspire your people as a boss, no magic bullet. Depending on the situation and person, there are a variety of approaches, tools, etc., that will inspire your people and add that fuel they need. In our book, we cover ones such as being a purpose-led boss, being clear on expectations, and communicating the ‘why’. But based on our workshops at the Blue Lagoon Iceland, we’d like to share a few more ways and tips for inspiring your people:\nBring out the Trust building block\n- We heard time and time again from the Blue Lagoon bosses how critical trust was as a means to inspire their people, as a way to encourage them to return to the resort following the various volcanic eruptions. They explained that without this, their team's fears would have prevented them from leaving the safety and comfort of their homes and taking that step onto the resort. They did this by not only relying on the trust their people had with their bosses and the company, but also creating a new level of trust by bringing onboard scientists and specialists. This showed their people that they were taking the situation seriously and were committed to supporting them in the best way possible.  By having experts guide them in their decisions, it strengthened their people's trust by knowing that the company was doing the right thing for the business, for them, and for their customers. You can’t inspire your people if they don’t trust you enough to take that first step. Inspiration begins with trust.\nBring out the Compassion building block\n- Another building block we heard mentioned when we workshopped Inspiration was compassion. Bosses shared example after example of how they had acted compassionately towards their people to inspire them to work through these challenging times. One of my favorite examples was how, after a volcano-related closure, one of the bosses told us she came in before her team to take pictures of the resort. She shared them, letting her people know and see that it was safe to come to work and showing compassion by addressing any fears they may have had up front. I love this as it shows how this boss showed empathy by understanding her people’s fears and then acted compassionately by easing them through her actions.\nAn Inspirational boss shows up for their people through regular and meaningful acts of compassion.\nBring out the Communication building block\n- Finally, communication was another building block that bosses at the Blue Lagoon mentioned as critical in helping them inspire their people. They shared examples of their proactive and transparent approach to communication, using this as a way to fill the fuel tank of inspiration. From the business having weekly information meetings to bosses individually sharing with their people, they didn’t hide from sharing information. They used it as a powerful tool to inspire their people, allowing them to continue delivering unforgettable memories for their guests.\nLet us end by thanking our friends at the Blue Lagoon for enlightening us on how they’ve used and adapted the Inspiration building block to lead their business and people through volcanoes and earthquakes. They should all be very proud of themselves, being role models to other companies who deal with what life throws their way. You inspire your people, your guests, and most certainly me!\nPlease contact us if you want to learn more about how we can help leaders at your company.\nLeadership"
  },
  {
    "title": "The Tale of Two Bosses: From Debra to Debby",
    "url": "https://www.stepituphr.com/post/the-tale-of-two-bosses-from-debra-to-debby",
    "published": "Thu, 19 Sep 2024 23:00:00 GMT",
    "summary": "We're all are going to take on bad boss traits at some point in time. Here's a tale of when this happened to me.",
    "full_content": "The Tale of Two Bosses: From Debra to Debby\nDebra Corey\nSep 20, 2024\n4 min read\nUpdated:\nApr 12\nIn this blog I'll be sharing a very personal and embarrassing story of when I went from Debra to Debby, or what I like to describe as the tale of two bosses. Here goes . . . . .\nWhen I was a new boss I found it very challenging to deal with stressful situations. Whether it be a tight or unreasonable deadline, too many conflicting priorities, or a difficult customer. Things would and did throw me into a stress spin (I know that’s not a real phrase, but let’s go with it). The result was that my alter ego, who when I was a child my friends and family called 'Debby', magically appeared! Let me introduce you to her. She was impatient, short and sharp with her people, and often extremely demanding. Not at all like Debra, my other personality.\nThe result of this was that I turned into a bad boss. In fact, multiple types of bad bosses. This not only made it difficult for my people, but it also made it confusing as they weren’t sure when Debby would emerge. Looking back, I would put her into these bad boss types which come from the 10 types we explore in our\nbook\n:\nAvoider\n- Most of the time, Debby would hide away, which is what an Avoider boss does, only coming out to shout orders or lean over someone to try to get them to finish something quicker. This meant she wasn’t actually there for her people when they needed her, giving them support at the right time and in the right way.\nIgnorer\n- She was also an Ignorer, ignoring what her people had to say and contribute as she was too focused on her stress and on what she felt needed to be done and happen. This meant she missed out on what her people said, did and needed from her.\nHoarder\n- Thinking back, she was also a Hoarder as she was either hiding away or rushing from one thing to another, not spending the time sharing the information, feedback, etc. that her people needed from her.\nCoercer\n- And she was absolutely a Coercer. She’d pop in and out, using power to get things done, often intimidating the people who she actually genuinely cared about and for.\nSolutions\nDoes this sound familiar? I wouldn’t be surprised if it did since, for many of us, we let stress consume us, drawing out our alter egos. To help in these situations, let us share with you some solutions and some ways to overcome these bad boss traits using building blocks from our Great Boss Building Block Model™:\nAuthenticity & Vulnerability\n- The starting point is the use of the Authenticity and Vulnerability building blocks, which w\ne describe as things you “wear” to show your all-important true self. In situations like the one described, we too often hide the stress from our people, not wanting to show (and wear) it for fear that doing so will make us look weak and not worthy of their trust and respect. Rubbish! From our experience, your people will be more likely than not to understand and relate with you when you show and don’t hide these feelings from them, especially when it comes to stress, as it’s something we all have experience dealing with.\nBecause of this, we suggest that in these situations, you come clean with your people. Admit that you’re having these problems and “wear” them so that they’ll understand why and when your alter ego may come out to play when things get too stressful. You may be surprised that they will relate to you, sharing that they have similar problems, or may even have some coping mechanisms that they have successfully used that you can try out yourself. And the added bonus is that when you role model authenticity and vulnerability in this way you show them that it’s ok to wear them, which in the future makes it easier for them and you.\nEmpathy & Compassion\n- Too often when we get stressed we focus solely on ourselves, which stops us from taking the time to be empathetic and compassionate towards our people. As we explain in our book, when it comes to empathy we need to remember that the “door” to it swings both ways, so you don’t just need to be empathetic by opening the door to the feelings of your people, but you need to open the door to your own self-awareness,\nbeing intentionally and consciously aware of how your emotions and behaviors are influencing those around you.\nBut it isn’t enough to just be empathic, you need to take it to the next step by showing compassion and taking action both in the short and long term. For example, in the situation described, the long term solution would be to figure out ways to remove the stress so that Debby never appears. However, since this may take time, there are short term actions that could take place. In fact, after openly explaining my challenges to my people, we agreed that until I got the stress under control, I would hang a sign outside my office door (yes, this happened in the days of bosses having separate offices), one  that said: “Debby is in the office - enter at your own risk.” It was far from perfect, but it was our way of accepting and embracing my bad boss traits as I worked on overcoming them and at the same time, protecting everyone from Debby!\nIn summary, should you face similar challenges remember to:\n“Wear” authenticity and vulnerability, showing your people that you’re not perfect, letting them know that you’re having some challenges.\nShow your people empathy and compassion, considering their needs and not just focusing on your own.\nIf you'd like to have someone come in to speak or run a workshop with your leadership or management team about how to be a great boss, sharing what we call the 3 A's, please contact us, we'd be glad to help.\nLeadership"
  },
  {
    "title": "4 differences between incentives and recognition",
    "url": "https://www.stepituphr.com/post/4-differences-between-incentives-and-recognition",
    "published": "Tue, 23 Jul 2024 06:53:26 GMT",
    "summary": "In this blog I share 4 differences between incentives and recognition, helping you use them both in the most meaningful and effective ways.",
    "full_content": "4 differences between incentives and recognition\nDebra Corey\nJul 23, 2024\n3 min read\nI walked into my MD’s office, prepared and ready to discuss a recognition program that I wanted to put into place. I got through about two minutes of my presentation and they interrupted me to say - “Isn’t recognition the same as incentives? Why should I spend time and money on recognition if I’m already paying my people incentives?”\nWhen I picked my jaw up off of the floor, surprised to hear this reaction, I calmly explained why they were not the same thing, and why we absolutely positively needed both.\nI shared this story recently in a talk I gave about recognition, so thought I’d share it in this blog along with how I got my MD to change their mind and agree to put in place a recognition program. I hope you never find yourself in this situation. But should you, you may want to refer to this explanation of the four key differences to help you overcome these challenges.\n1. Different expectations\nThe starting point is to explain the differences between the two regarding employee expectations. With incentives, which some people refer to as a carrot-and-stick approach, there are specific expectations. You dangle a carrot on a stick out to people to do something - sell a product, hit a milestone, etc. - and you get a reward in return. By doing this, you’re setting an expectation with your people - e.g., when I do x, I will receive a reward.\nOn the other hand, there are no real expectations when it comes to recognition as there is no carrot and stick. Yes, employees know that if they do a good job, they may be recognized, but it’s not expected - e.g. I do x, and I may or may not receive a reward.\n2. Different motivations\nAnother difference concerns the motivations behind each. For example, how will they motivate my people to perform? For incentives, the motivation is extrinsic, as what motivates your people to perform is external, the reward.\nThe motivation to perform when it comes to recognition is very different, this time intrinsic. Employees are not motivated by what they could receive but by their internal motivation and drive to perform and succeed.\n3. Different purposes\nNext, there are differences in the purposes of each and what they ultimately reward. Incentives are used to reward employees for work that is done in a linear, one-dimensional, or straightforward way—e.g., you have a specific goal (carrot) to achieve in a very specific and defined way. Only then will you receive the reward.\nOn the other hand, recognition is used as a way to reward employees for both what\nthey did and how they did it, often not aligned with a specified way to do so. For example, you recognize someone for taking the initiative to come up with a new idea for the company (recognizing the what), you recognize someone for living one of your values by supporting a colleague (recognizing the how), etc. In addition, when recognition is done well, it rewards employees at times when they may not have hit a specific goal. For example, you recognize a salesperson for going above and beyond to try to win a new sale they did not get because of reasons outside of their control. With incentives, this would not happen.\n4. Different timelines\nAnd finally, there are differences in the timelines and impacts associated with each. For incentives, as Daniel Pink says in his fantastic book\nDrive\n:\nIncentives “can deliver a short-term boost - just as a jolt of caffeine can keep you cranking for a few more hours. But the effect wears off - and, worse, can reduce a person’s longer-term motivation to continue the project.”\nRecognition often has a more long-term impact due to its nature. When someone recognizes you, you feel seen, valued, and appreciated, and the feeling lasts longer since it touches you in multiple and different ways. With incentives, yes, you feel great, but it’s for one thing: achieving a specific goal.\nHere is a summary of the key differences shared in this blog:\nLet me end by saying that both of these tools and programs can help you motivate and reward your people. The key, the magic, is to use them together in the most meaningful and effective way. All the best, go out there and motivate, appreciate, and reward your people for all the great things they’re doing and achieving!\nPlease\ncontact me\nif you'd like to discuss how you can create innovative and effective reward and recognition programs at your company.\nRecognition"
  },
  {
    "title": "Living the Dream at John Good Group",
    "url": "https://www.stepituphr.com/post/living-the-dream-at-john-good-group",
    "published": "Mon, 15 Jul 2024 16:22:26 GMT",
    "summary": "John Good Group's 'Living the Dream' program offers employees the opportunity to make a dream a reality completely on them.",
    "full_content": "Living the Dream at John Good Group\nDebra Corey\nJul 15, 2024\n4 min read\nJohn Good Group is a company that is rooted in its heritage, and at the same time, in the future. Their philosophy brings this together by saying that “every day is an opportunity to celebrate the past and create bold new plans for the future.” This is evident in how they help businesses grow in sustainable ways, and in how they help their people in their strategic and innovative HR programs.\nA perfect example of this is their ‘Living the Dream’ program, which I first heard about when Rachel Lowe, Chief People Officer, posted about it on LinkedIn. I was so impressed and intrigued that I immediately messaged Rachel, asking if I could interview her to learn more about it. Here’s what she and Chloe Lawson, Junior People Advisor, shared with me.\nWhat is Living the Dream?\nLiving the Dream is John Good Group’s new people initiative that was developed as a way to show appreciation to their people by providing them with the opportunity to have a life-changing experience.\nAs Rachel and Chloe jointly explained, “We all have those dreams, aspirations, or unique experiences on our bucket list that we’ve been longing to achieve. At John Good Group, we want to change that, offering our employees the opportunity to make one of these dreams a reality completely on us. If you can dream it, we will make it happen.”\nThis special initiative takes place twice a year during our Summer and Christmas social events. During each event, one lucky employee’s name will be drawn, and they will win the experience of their lifetime. From the extravagant to the tame - flying a plane, scuba diving in The Great Barrier Reef, racing in a Lamborghini, trekking the Great Wall of China - employees enter their dream, and the company makes it happen.\nThe first winner was selected at their Christmas party, with their dream being to learn how to surf on Bondi Beach, Australia. And the second winner was just selected at their Summer BBQ, with their dream being to\nsee the lantern festival and wash elephants in Bali. Brilliant!\nWhy did you put ‘Living the Dream’ in place?\nAt John Good Group, their mission isn’t just about professional success, they’re dedicated to enhancing the personal lives of their employees as well. They do this through a variety of programs and initiatives (more on this below), but Adam Walsh, their new CEO, wanted to do something more. He wanted to put in place a new form of recognition, something everyone would love, and something to create memories to associate back to the company, especially as they continue to grow.\nThe result was the introduction of the ‘Living The Dream’ initiative. It most certainly meets the objective of enhancing the life of the winner, giving them the opportunity to have a once-in-a-lifetime experience, but even for those who don't win, they have that special moment of dreaming of their experience as they all wait for their name to be selected.\nHow have your employees reacted to the program?\nThere has been a real energy about the ‘Living the Dream’ program. According to Lowe, “It’s become the talking point in the staff breakout areas, with them sharing stories of what they want to do.”\nThis sense of energy has also gone into how they announce the winner, not merely calling out a name, but building up momentum and excitement. For the first reveal,\n“We wanted to build up the excitement in the room by not revealing the name straight away, but by announcing which business within the group the winner was from, and then revealing their dream, and finally the name,” said Lawson. For the most recent reveal, their CEO did it slightly differently, calling up to the stage everyone from group, then joked and said, “it’s none of you.” He then called forward employees from the winning Operating Company, and this time said, “it is one of you,” getting them all excited. Finally, he revealed the dream and the winner, love it!\nWhat other initiatives and programs do you have?\nThe ‘Living the Dream’ program does not stand alone, for at John Good Group they have a variety of other programs to show their employees that they value and support them. Here are just a few that stand out:\nLong service recognition\n- Their approach to long service is unique and aligns with their mission and values. First, because it begins at year 1, which is very different to many organizations. And second, because like the ‘Living the Dream’ program it also focuses on experiences and memories, with employees receiving vouchers for experience days in different ways and amounts based on their anniversary year.\nCharitable programs\n- The Matthew Good Foundation was created after Matthew Good’s death in June 2011 during a charity marathon. Matthew was part of the John Good Group family business and had a strong desire to create a positive impact on employees and communities. The Foundation supports their employees’ charitable activities in a variety of unique and meaningful ways, including monthly draws to win donations for the charity of their choice, championing small voluntary initiatives, double matching staff fundraising efforts, and providing funds and guidance to start their own grass-roots projects.\nLet me end by thanking John Good Group for sharing their story with me, and now with you. I hope it inspires you to find your own ways to support your people in creating memories and experiences.\nPlease\ncontact me\nif you'd like to discuss how you can create innovative and effective reward and recognition programs at your company.\nRecognition"
  },
  {
    "title": "First Bus’s approach to driving recognition their own way",
    "url": "https://www.stepituphr.com/post/first-bus-s-approach-to-driving-recognition-their-own-way",
    "published": "Mon, 17 Jun 2024 12:43:44 GMT",
    "summary": "4 ways that First Bus use recognition to show appreciation to their employees, doing it in their own way.",
    "full_content": "First Bus’s approach to driving recognition their own way\nDebra Corey\nJun 17, 2024\n4 min read\nUpdated:\nJun 18, 2024\nFirst Bus, the UK’s leading bus operator, is on a massive transformation journey, changing the culture for their 13,000 employees working across the UK and Ireland. Key to this is listening to their employees, gaining their perspectives and insights through vehicles such as an employee engagement survey.\nOne thing that’s become clear is employees would like more recognition and to feel appreciated. First Bus listened and created a recognition awards evening titled ‘Our Way’ Awards, which was held in London in April 2024.\nAccording to Rachel Alderson, Employee Engagement Lead, ”We wanted to address colleagues ‘feeling unappreciated’ which is the highest scoring emotion on the Employee Engagement survey and embed ‘Our Way’ values further into the business. It was an opportunity to celebrate success with our people to give them the recognition they deserve.”\nIn this blog I’d like to share some of the things that First Bus did to show their commitment to creating an event that delivers what I call the ‘appreciation feeling,’ and at the same time, supports and showcases the new culture they are striving for.\nInclusive nomination process\nFor many companies, the nomination process is quite straightforward. You send out an email and/or post something on your company intranet, and bang, you get tons of nominations. But with 90% of their workforce being bus drivers, not being in an office or in front of a computer, this just wouldn’t work.\nSo instead, their nomination process involved having each of their senior leaders across the different business units own the process. By doing this, they made sure that they had an inclusive approach, one where every group of employees was represented, and given the opportunity to be recognised.\nCreated a new recognition award category\nAt the start of the process there were four recognition award categories to align with their four values - Always Care, Do What’s Right - Succeed Together - Shape the Future. However, as the nominations started coming in they found that there were some amazing ones focusing on heroic actions, employees saving lives while going about their day-to-day activities. Because of this, they decided to create a new category, one recognising and celebrating these heroic contributions.\n“We decided that these deserved to stand on their own due to the impact they’ve had on our customer’s lives. It was the last award given on the night, and it had a huge impact on everyone in the room” said Alderson. I love this as it shows the importance of being flexible and adaptable as you design and deliver your recognition programmes. And it was such a success that it will continue to be a category in future years.\nMade everyone feel like a winner\nOften what happens at award events is that the only people who feel like winners are those that ultimately win the awards. However, the First Bus team organised an event where everyone felt like a winner, where they all left feeling great. From the bar of chocolate with a congratulations message waiting for them at their table, to the band that got everyone up and dancing throughout the night, to having senior leadership team hosts at each table so there would be someone that they knew, they thought of the little things to make the night feel special to everyone attending.\n“The focus wasn’t just on the recognition awards, we wanted to make it great for everyone. For many of our employees they had never attended an event like this, so we did our best to make them feel comfortable and to have fun whether they won or not” said Alderson.\nThought of the little things\nI’ve already shared some of the little but important things the First Bus team did when organising and running the event, but one more example has to do with the awards that were given.\nWinners received two things - a trophy and a gift. The trophy was made of recyclable materials, which aligns with their mission to protect the planet. And the gift was a voucher, which aligns with their focus on diversity, giving employees the choice to select the gift that is right for them. These show their commitment and alignment to what matters most, sending a message to their employees that what they talk about are not just words, but actions, and, going back to what I said at the beginning, that they were being listened to.\nLet me end by sharing what Rachel put on LinkedIn about this event, which is where I first heard about it. I think it sums up the impact and difference it made to their people. Congratulations to Rachel and the team at First Bus, they did a fantastic job with this event and with the other things they’re doing to drive and deliver the appreciation feeling (sorry, I couldn’t resist throwing in a pun 😂).\n“Recognition is key to making people feel engaged and helps drive a culture where people feel valued, a sense of belonging and proud to work for you. A small thing, but so powerful. 💥 It’s human nature to smile when you see others smiling, and there was lots of people revelling in the joy of others winning - true team spirit right there!”\nPlease\ncontact me\nif you'd like to discuss how you can create innovative and effective recognition programs at your company.\nRecognition"
  },
  {
    "title": "3 Ways to Communicate with Empathy",
    "url": "https://www.stepituphr.com/post/3-ways-to-communicate-with-empathy",
    "published": "Tue, 14 May 2024 23:00:00 GMT",
    "summary": "Communicating to your employees is easy, right? All you have to do is share words and concepts, how hard can it be? Well according to one...",
    "full_content": "3 Ways to Communicate with Empathy\nDebra Corey\nMay 15, 2024\n4 min read\nUpdated:\nMar 2\nCommunicating to your employees is easy, right? All you have to do is share words and concepts, how hard can it be?\nWell according to one\nsurvey,\nalmost seven out of ten managers (69%) admitted feeling uncomfortable communicating with their employees\n, being uncomfortable with “becoming vulnerable, recognizing achievements, delivering the ‘company line,’ giving clear directions, crediting others with having good ideas, speaking face to face, and having difficult feedback conversations in general.”\nIt doesn’t surprise me that so many bosses find communication daunting. Unlike with basketball when the hoop is always the same, always 10 feet above the floor, our employees are far from being the same.\nThat’s because people take in and translate information in different ways when they receive communications. That constant pressure of “scoring” with what you’re trying to communicate leads to worrying, and often, even an “air ball.” Similarly, if the employee(s) you are speaking to are under a lot of pressure, they might be thinking about the work they are supposed to be doing rather than listening to your communication; much like a basketball player not being in the right place to receive a pass.\nIn our book (\nBad Bosses Ruin Lives: The Building Blocks for Being a Great Boss\n) we share many tips on how to improve your communication skills. The area we’d like to focus on in this blog relates to communicating with empathy, which has\nto do with\nthe way\nyou communicate, e.g. the tone, words, and approach that you use. This is critical to keep in mind, for even if you communicate in the most effective way, without empathy or bringing compassion to the situation, then it will fall flat and not meet your objectives.\nEmpathetic communication is delivering information in a way that understands and addresses the feelings and needs of the recipient.\nIf done well, it’s a win-win, with you being able to effectively “throw” the message to the recipient, and them being able to “catch” it as they’re in the right space and frame of mind to do so.\nTo help you with this, let’s look at how to use empathy in three ways - the what, when, and where you communicate information:\n1) Consider the \"what\"\nUsing empathy in sharing information is impacted by both\nwhat information you share\nand\nwhat words you use\n. Here’s an example of when I got it wrong when it came to the first part.\nI had an employee who was on maternity leave, something I had never been on myself at this point in time. Because of this, I couldn’t put myself in her shoes and didn’t do what I now understand to be important, which was to ask her what kind of information she wanted from me during this period of time. The result was that I hoarded information, not sharing it with her because I thought she wouldn’t want it, thinking that she’d be too busy taking care of her newborn to read any of it. Wrong! When she came back from her leave, she was quite angry with me for doing this, saying that the information would have helped her feel more connected to the business and her colleagues, and would have made her transition back to work much easier. Ouch, did I get this wrong or what?\n2) Consider the \"when\"\nBelieve it or not, the\ntiming\nof when you share information can have an impact on how it makes your people feel, and thus needs to be addressed in an empathetic way. Here’s an example from our friend Pat, with a boss who got it completely wrong.\nThe situation was that on Pat’s last working day before they had a week off for the holiday season, Pat’s boss said that they needed to talk to them immediately. They jumped on a call, where Pat was told that the team was going to be reorganized and that Pat would find out more details when they came back from the holiday break. As you can imagine, Pat panicked, wondering how this would impact them and their team, and spent the entire week worrying about it instead of enjoying the holiday with their family and friends. In this situation, my challenge to Pat’s boss would have been, did you really need to do it then? What would have happened if you had waited another week?\n3) Consider the \"where\"\nAnother thing you may not have considered is where you share and put the information. Do you share it in an email, on a team call, or even a text? Make sure that the information is available in a form the employees can refer back to to refresh their memory, and that they all know where it is. There are so many ways to do it, so think about what will work best for your people and for the specific communication.\nYou\nmay also want to signpost your people to find out more information on their own, especially if it’s ongoing or far into the future. What kind of FAQ or other information do your employees need to save you time from answering questions and so they feel the most informed?\nCommunication\nLeadership"
  },
  {
    "title": "4 tips for figuring out which company values to invite ‘to the table’",
    "url": "https://www.stepituphr.com/post/4-tips-for-figuring-out-which-company-values-to-invite-to-the-table",
    "published": "Thu, 25 Apr 2024 06:06:39 GMT",
    "summary": "Tips to help you decide which company values to invite to the 'table,' ones that drive the right actions and behaviors to help you succeed.",
    "full_content": "4 tips for figuring out which company values to invite ‘to the table’\nDebra Corey\nApr 25, 2024\n4 min read\nIn a previous\nblog\nI talked about the importance of having values as unique as your company. Great, but as I’m often asked when I work with organizations, how do you do  this? To answer this, let me share some tips from the second step of my\nWTH process\nwhich includes the following:\nW = Put your values on the wall, coming up with a long list of potential values\nT = Invite your values to the table\nH = Bring your values home, making them your own\nThis second step is where you take the long list of potential values from the first step, refining and prioritizing those that\ndeserve a seat at the table\n. And like a table, there are only so many seats around it, so it’s here that you have those difficult (but lively) discussions in order to decide which ones are and which ones are not seat worthy.\nYour company values should be ones that you just can’t walk away from as they are so critical to the life, health and success of your business.\nOne approach for helping you narrow down and fine tune your list of values is by using the “keep, kill, and combine” process. For each value you’ve ‘put on the wall,’ go back and decide which of these three actions to take:\nKeep: put a tick next to these\nThese are the values that tick all if not most of these four questions in step one:\nAre they servants to my purpose or mission?\nAre they specific to my company?\nCan (and will) they be lived and acted on?\nCan (and will) they take us to a new planet?\nThink of them as values that are\nat the heart and core of who you are and what you want and need to be\n.\nKill: draw a line through these\nThese are the values that either don’t tick any of the question boxes or if they tick one, they are in conflict with the others, e.g. could cause problems to these.\nThey could also be what Patrick Lencioni in his book\nThe Advantage\ncalls permission-to-play values, which he describes as being “the minimum behavioral standards that are required in an organization. Values often seen in this category are those such as trust, integrity and ethics. Now don’t get me wrong, these are absolutely essential to have at any company, in fact, they are like the air that we breathe. But my question and challenge is - should they be standalone values? Or instead, should they be woven into your values, thus making them an integral and natural part of how you run your business and how employees behave?\nFor example, if you believe that trust should be one of your values, ask yourself why? What does trust really mean and why do we need it to make our company great? Is it trust in how you work together, in how you communicate with each other, or in how you respect each other? Pinpoint the behaviors related to trust that you need to see, and then weave these into your values that truly deserve a seat at the table.\nCombine: circle these\nThese are the values that are similar to one another, so could be combined to have a better overall impact. Look for themes amongst these, so that you can narrow them down and cluster them together.\nThe outcome of this step is to have a manageable list that you can take forward to the next step, where you select your ‘winning’ values and make them your own. How you define manageable is up to you, the focus at this stage should be less about the number of values and more about the quality of values. Take forward those that you can easily and readily explain and defend - that is the key.\nAnd speaking of taking them forward, there is one more thing I’d suggest doing before going to the final step, which is to\ntest them out\n. The result of this is that you feel confident that you have stress tested your draft values by running them by your leaders and workforce to see if/how they resonate with them. It’s important to go through this process with them both as they’ll have different needs and different perspectives. Here’s what I mean . . . .\nFor leaders\n, you’ll need to test that the values are ones that will drive the business strategy and at the same time drive the right behaviors. They need to ask themselves, will they help me hire the right people - recognize the right behaviors - manage performance - and, when things get tough, help or hinder decision making? Will they help me be a better leader? And finally, will I be able to embrace and role model them?\nFor your workforce\n, you’ll need to test that the values speak to your employees in a way that they help them be understood as well as understand what is expected of them. Try to uncover whether they will create an emotional connection, getting your workforce excited and behind them.\nI hope you’ve found this helpful in either discovering or rediscovering your values. If you’d like to learn more about this you can read my book\nBringing Your Values Out to Play\n, get my\nDIY Values Toolkit\nor\ncontact me\nfor questions or support. All the best!\nTags:\nCompany values\nCompany Values"
  },
  {
    "title": "Banishing 3 monsters created through your reward programs",
    "url": "https://www.stepituphr.com/post/banishing-3-monsters-created-through-your-reward-programs",
    "published": "Wed, 17 Apr 2024 14:38:32 GMT",
    "summary": "This blog examines 3 monsters that are created when you design your reward programs wrong, and tips to help get it right.",
    "full_content": "Banishing 3 monsters created through your reward programs\nDebra Corey\nApr 17, 2024\n4 min read\nUpdated:\nMar 2\nWhen my children were young, their favorite book was\nThe Monster at the End of This Book\n, written by Jon Stone and starring the lovable, furry Grover from Sesame Street. They loved it because at the end of every other page, the book says “Don’t turn the page, there’s a monster at the end of this book.” And, like any child, mine did just that — they turned the page! And, like any parent, we laughed and cheered them on. But when I think back on this, it makes me realize that as fun as these moments were, they did in fact reward and reinforce bad behaviors in my children.\nWhy am I telling you this? Because I believe many companies are doing the same thing when it comes to their reward programs, with them encouraging and rewarding bad behaviors in their employees. In fact, I believe that we are also creating our own versions of monsters — and they are certainly not as cuddly and lovable as Grover is!\nHere are three of the monsters that I’ve seen throughout my career as a result of poor designed reward programs. And so you’re not left with “monsters at the end of your book,” I’m also sharing some ways to banish them from your organization.\nThe Bimble Monster\nThe first monster is the Bimble Monster. This monster, and these employees, bimble along as they go about their work, doing so at a leisurely, and often ineffective, way as they receive little direction and encouragement to help them understand if what they are doing is acceptable, unacceptable or even damaging to the company. I’ve seen this happen in two ways:\nThe first way is through a\nlack of transparency in pay programs\n, with companies not clearly explaining to employees\nhow\ntheir pay is determined and\nwhat\nthey need to do to receive further pay increases. This causes confusion, frustration and lots of bimbling, as employees are lost in a maze of confusion, trying different paths and approaches in order to receive the highest pay possible.  To rid your company of these monsters, take a step back and look at how well you are communicating to your workforce the details behind your pay strategy, pay structures and performance-related pay approach. Don’t leave it to chance that your employees will understand how they work, but develop clear communications and education sessions at every step so that your employees can easily see the path they need to take when it comes to their performance and their pay.\nThe second way is through the\nlack of timely recognition programs\n, with many organizations focusing recognition mainly on long-service and best-in-class (e.g. annual, quarterly and monthly) programs. This again causes confusion and bimbling, as the majority of employees will not be recognized, which means they are receiving little to no encouragement and direction. And even for the few being recognized, the distance between their achievement and their award is often so great that even these employees are bimbling along.\nTo rid your company of these monsters, implement a continuous approach to recognition, one that focuses on recognition in-the-moment, so anytime and from anyone. In my book titled ‘\nAppreciate it!\n’ I share many examples of these everyday programs which can be as simple as having a Post-It wall where anyone can put up a recognition message, to something more robust such as eCards or other options that leverage technology.\nThe Gimme Monster\nNext is the Gimme Monster. This monster, and these employees, often start out “normal” until they see someone else rewarded differently for what they view as a similar action or contribution. An amusing example of this comes from Frans de Waal, professor of primate behavior, at Emory University’s\nTED Talk\n. In it, he shares the results of a study of two monkeys, showing what happens when they are “paid” differently for performing the same task. In the study, all was good when both monkeys were receiving cucumbers for the same task, but as soon as one monkey received grapes, the other monkey was no longer satisfied, saying in their actions to “gimme” this new reward.\nTo rid your company of these monsters, assess your reward programs to determine if any Gimme monsters may appear based on their design. For example, do you have a bonus program that rewards your sales team for winning a new sale, but ignores everyone else in the company that contributed to the sale? Do you recognize all members of a team for living a company value, or possibly just the person who is the most visible? Challenge yourself to assess the fairness of your programs, making sure none of your employees act like the monkeys and, in a tantrum, throw the reward back in your face.\nThe Sticky Monster\nThe final monster is the Sticky Monster. This monster, and these employees, stick around at your company well past their “sell-by” date due to the design of your reward programs. And, like a product in your refrigerator that has expired, they stink up your company as they really don’t want to be there, only sticking around to receive the awards through these programs.\nOne example of when this happens is with share programs, where the program is designed so that employees lose their shares, and thus potential earnings, should they leave the company. Another example is with long-service programs, where employees receive overly generous cash or gifts for staying at the company. Both of these examples lead to and create stickiness, or what we often call “golden handcuffs.”\nTo rid your company of these monsters, look at the rules and awards you provide under your reward programs. Here are two examples:\nFor your share programs, ask what would happen if you let employees keep any shares that were already vested when they leave the company. This is exactly what we did at a previous company when we started seeing too many sticky monsters, and responded by removing the rule saying that shares were lost if employees left the company.\nFor long-service awards, ask if you really need to award such high-level, high-value awards. You can still make employees feel valued without spending so much that they dare not leave before receiving it.\nThe key to your success is to first be aware of what attracts these monsters through your reward programs, and second, to bravely and rebelliously modify them to set your employees — and your company — up for a happy ending.\nTags:\nReward programs\nEmployee Engagement\nBenefits"
  },
  {
    "title": "4 Traps Tripping up Bosses",
    "url": "https://www.stepituphr.com/post/4-traps-tripping-up-bosses",
    "published": "Mon, 15 Apr 2024 23:00:00 GMT",
    "summary": "I firmly believe that the majority of bosses do not intentionally set out to be a bad boss. They don’t wake up in the morning, get...",
    "full_content": "4 Traps Tripping up Bosses\nDebra Corey\nApr 16, 2024\n5 min read\nI firmly believe that the majority of bosses do not intentionally set out to be a bad boss. They don’t wake up in the morning, get dressed, eat their breakfast and say to themselves,\n“What can I do today to be a bad boss? What can I do to ruin the lives of my people?”\nAnd yet time after time, person after person, that’s exactly what is happening, with well-intentioned bosses getting it wrong. Instead of being the great boss they want and need to be, they are doing the opposite of what they set out to do. They’re making bad decisions, taking bad actions, and causing bad impacts on\nretention\n(57% of people surveyed said they left their company because of their boss),\ntrust\n(64% of people surveyed said that they’d trust a robot more than they’d trust their boss), and\nemployee engagement\n(managers account for at least 70% of the variance in employee engagement scores) to name a few.\nWhy is this happening? Why do we have so many bad bosses, which according to our survey, 99.6% of people said they’ve had?  One of the main causes is what we call “traps,” things we blindly fall into that trip us up and lead us to these bad behaviours and actions.\nHere are four common traps explored in our book ‘\nBad Bosses Ruin Lives: The Building Blocks for Being a Great Boss\n.’ Along with these, I've shared examples relating to the 10 types of bad bosses we define.\nTrap\n#1\n: Time\nLet’s face it, being a boss is not easy. You're pulled in multiple directions and often have competing demands. For this reason, one of the most common traps bosses fall into that causes them to adopt bad boss traits is time, more specifically, the feeling that there isn’t enough time to act in any other way.\nAn example is the Micromanager boss, someone who is overly involved in their people’s work, constantly controlling and prescribing what and how work is done. They often fall into the time trap as they believe that they don’t have the time to teach or explain things to their people, so manage them at every turn and step or “just do it myself.” In reality, this actually ends up increasing their time demands as their people rely so heavily on them, not being able to do things on their own and being a bottleneck to their people and the business.\nThe Micromanager Boss\nActions to take:\nTo avoid this trap, bosses such as Micromanagers need to challenge themselves to weigh the pros and cons of their actions. Remind themselves that in the short term it may take a bit more time to release the controls, but in the not-so-distant future it will help them reap the benefits of more time.\nTrap\n#2\n: Misguided beliefs\nWhen surveying bosses on which of the 10 types of bad bosses they’ve been, the most common response was the Pretender, someone who puts on a mask so their people don’t know that there’s a problem or issue.\nBosses often act in this way because they fall into the trap of misguided beliefs, believing that this is what their people want and need from them. And because of this, the Pretender boss withholds the truth, gives answers they feel are wanted, and fails to give their people the honesty they need and deserve.\nAn example of this is when feedback is withheld following a difficult situation or when a problem occurs, with the Pretender putting on a mask and acting like nothing is wrong. The problem with this is that it can have a\nsignificant impact on performance, perpetuating bad performance and setting the person up to fail time and time again. In Kim Scott’s book\nRadical Candor\nshe calls this “ruinous empathy,” where you put caring too much above hurting the feelings of your people. And like anything ruinous, it can cause disasters in how your people act and what they can and cannot achieve.\nThe Pretender Boss\nActions to take:\nTo avoid this trap, bosses need to challenge themselves to understand what their people need and don’t need, and base their actions and behaviours on these, and not assumptions.\nTrap\n#3\n: Confusion\nAnother common trap is confusion, often caused when there is confusion between intent (what we intend and believe to be happening) and impact (what is really happening).\nAn example of this is the Coercer boss, someone who uses power in the wrong way in order to control and coerce processes and outcomes. They’re often confused, believing that this use of power is necessary and isn’t causing problems. But because the impact of such actions often leads to fear, their people tend to hide the impact and problems that this can and does create.We talk about this in our book when describing the difference between fear and respect, and how sometimes we mistake and confuse one for the other. And while fear can be one of the most disabling behaviours, stopping your people in their tracks, respect can deliver enormous benefits and returns to your people and your business.\nThe Coercer Boss\nActions to take:\nTo avoid this trap, bosses need to closely look at their impact versus intent, understanding whether what they want and need to happen is actually taking place or is being masked in fear or any other negative emotions.\nTrap\n#4\n: Skills\nNew bad bosses get created because, quite frankly, the role keeps changing, making it harder and harder to be a great boss. Just look around you. Your workforce is different and more diverse than ever with five generations working side by side, the workplace is different with new work arrangements and AI impacting how and where work gets done, and expectations from your business, customers, and people are different as well. Add it all up, and the skills required to be a great boss now are drastically different to those that were required in the past.\nThis leads me to the final trap, which involves assuming that you have the right skills to be a great boss. An example of this is with the Unappreciater boss, someone who doesn’t show their people recognition or gratitude, making them feel unvalued, invisible, and unappreciated for their actions and contributions. I’d like to say that over the years bosses have developed the skills to show appreciation, but it was actually the highest ranked bad boss in our survey, with 81% of people saying that they’ve had this kind of bad boss. This means that the majority of bosses have not yet learned the skills to give meaningful, genuine and timely appreciation to their people. Or as I say in another one of my books, they don’t know how to ‘\nSee it. Say it. Appreciate it!\n,’ delivering the appreciation feeling.\nThe Unappreciater Boss\nActions to take:\nTo avoid this trap, bosses need to be honest with themselves and equip themselves with new skills to tackle their bad boss traits instead of trying to be a great boss using bad boss skills and techniques.\nI hope you’ve found these explanations of traps helpful, and can use them to ensure that you aren’t tripped up by them in your quest to be great!\nIf you’d like to read more on avoiding these traps as well as how to be a great boss, please read our book\nBad Bosses Ruin Lives: The Building Blocks for Being a Great Boss\nor contact us to chat more.\nLeadership"
  },
  {
    "title": "Appreciation through the eyes of a Gen Z",
    "url": "https://www.stepituphr.com/post/appreciation-through-the-eyes-of-a-gen-z",
    "published": "Thu, 04 Apr 2024 06:43:03 GMT",
    "summary": "When chatting to my 21-year old son the other day, I asked him how his first proper job was going. Expecting the usual one-word response,...",
    "full_content": "Appreciation through the eyes of a Gen Z\nDebra Corey\nApr 4, 2024\n3 min read\nUpdated:\nApr 17, 2024\nWhen chatting to my 21-year old son the other day, I asked him how his first proper job was going. Expecting the usual one-word response, he surprised me by telling me all about how his company had given him two appreciation awards, and how much it had meant to him.\nSince many of us are trying our best to understand and support our Gen Z employees, I thought I’d share this conversation with you. It includes his answers to my questions, as well as my thoughts. I hope you find both perspectives helpful.\nWhat recognition awards did you receive?\nHim:\nI received two different awards. The first was for the work we did on completing a project, and the second was for work we did organizing and conducting a PR-related task.\nMe:\nI like that his company recognized\ndifferent types\nof work (one was for a project and one was for a task), showing that both are valued. I also liked that they recognized\ndifferent time frames\n(one was long-term work and another short-term work), as it shows appreciation for all moments that matter, big and small.\n“Recognition should not be one dimensional. It needs to have multiple dimensions to reflect the way your people work, contribute and deserve to be appreciated.”\nHow did it make you feel when you received these awards?\nHim:\nIt made me very happy and very proud of our work and accomplishments. I used the award voucher to buy new clothes, which also made me happy.\nMe:\nI like that his company gave him a voucher as I’m a big believer in recognition awards that provide choice to employees, letting them decide what is right for them. And as a mother, I loved that these awards made him both happy and proud, fantastic!\nSome might say that these awards were given for doing your ‘day job,’ what do you think about this?\nHim:\nI believe that we deserved these awards as we exceeded expectations for the work that we were asked to do. For the first award, the project, we got it done early, which was great for our company and customers. And for the second award, the PR work, it went so much better than it was expected to go, which again was good for our company.\nMe:\nI asked this question as it’s something I’m asked quite often when doing talks on recognition, so I thought it would be interesting to get his perspective on it. I was pleased that he saw the difference between completing his work and doing something that is above and beyond, and thus deserves a recognition award. It’s important that this distinction is understood when programs are designed and awards are given.\nBy receiving these awards, will it make you expect to be recognized all the time?\nHim:\nNo, I wouldn’t expect to receive awards all the time. In fact, I didn’t expect to receive either of these awards.\nMe:\nI asked this question to make the point that giving recognition doesn’t necessarily set expectations, something that I know many businesses fear. He was surprised and delighted receiving both awards, and as he response shows, it didn’t cause him to think that he’d be recognized each and every time he completed work.\nWhy is appreciation important for Gen Z’s?\nHim:\nIt teaches my generation the meaning and importance of appreciation, something we don’t really know much about as we’re new to the workplace. It also shows us what our company values and thinks is important, and what we should work and focus on.\nMe:\nHe made a really good point in that this generation is still learning - learning what their company values and how their company feels about and treats them. Recognition is a great tool to teach them these important lessons, and by making appreciation an integral part of your culture it can not only show these young workers what good and great look like, but that you see and value their contributions. And since they will be our future leaders, it creates leaders who will make appreciation a part of how they lead and support their people.\nPlease\ncontact me\nif you'd like to discuss how you can create innovative and effective recognition programs at your company.\nTags:\nAppreciation\nRecognition\nRecognition"
  },
  {
    "title": "14 Building Blocks for Being a Great Boss",
    "url": "https://www.stepituphr.com/post/14-building-blocks-for-being-a-great-boss",
    "published": "Wed, 27 Mar 2024 00:00:00 GMT",
    "summary": "Let me be honest and say that I am a rubbish gardener. My heart is in it, but I lack the skills and knowledge to do it effectively. What...",
    "full_content": "14 Building Blocks for Being a Great Boss\nDebra Corey\nMar 27, 2024\n4 min read\nLet me be honest and say that I am a rubbish gardener. My heart is in it, but I lack the skills and knowledge to do it effectively. What this means is that my approach to gardening is to pull out the same one or two tools from the garden shed and attempt to use them in every situation. The result? Well, let's just say that I end up with lots of broken tools and plants that unfortunately need to be replaced.\nWhy do I share this with you when I’m talking about being a great boss? Too often, I see this approach happening with bosses, with ones who are well-intentioned getting it wrong and using the wrong tools in the wrong ways. And as with my garden, the results can be damaging and devastating for their employees and company.\nThat’s exactly why we created our Great Boss Building Block™ model, something that provides the\nright\ntools to deliver the\nright\nresults. What makes it different from other models? Two things - First, it’s\ncomprehensive\n, having 14 different tools that can be pulled out and used to meet the diverse needs of your people and business. Second, it’s\ncurrent\n, having modern tools that meet the changing needs of the evolving workplace, not ones that represent old ways of thinking and working.\nWhat is the Great Boss Building Block™ model?\nGreat Boss Building Block Model\nThere are 14 individual building blocks in the model, and since 14 is a big number, there are two things we’ve done to make it easier to understand and use:\nTwo types of blocks\n- As you may have noticed in the image, there are two types of blocks: the six on the bottom, which we call the “foundation” blocks, and the eight on the top, which we call the “connecting” blocks. The foundation blocks represent behaviors and mindsets required to be a great boss. In the past, they may have been considered “soft and fluffy,” but there’s no doubt about it, they’re more paramount now than ever before. They are called foundation blocks because, like the foundation of any structure, they are absolutely critical as they support the weight of what’s being built, ensuring it has a stable base. The second set of blocks are the eight connecting ones, which connect your people to you and your company, acting as tools to drive employee engagement and build stronger relationships. These blocks represent actions required to be a great boss and are valuable in different ways to meet the diverse needs of your people. These connecting blocks, firmly built together on top of your foundation, create a strong and enduring structure.\nBlocks work in pairs\n- Another thing you may have noticed is that the blocks are shown in pairs, with two sitting alongside each other. This is intentional as they all have a partner, another block that is needed for the other to be effective and/or working towards the same goal.An example are the Authenticity and Vulnerability blocks. They both focus on achieving the same goal, which is to create a\nsense of safety and trust for and with your people, leading to stronger collaboration, connections, creativity, and overall success. These two blocks work together to achieve these goals in different ways. Think of them as things you might “wear” as a great boss.\nWhat are the building blocks?\nSo what are these building blocks? Here are high-level definitions for each of them:\nEmpathy\n– You understand what your people feel and need based on their individual and diverse situations, challenges and frustrations.\nCompassion\n– You take action to encourage and support your people by understanding and empathizing with their individual and diverse needs.\nAuthenticity\n– You determine and display who you are, what you believe in, and your true self to your people.\nVulnerability\n– You reveal to your people the full spectrum of your true self, including your emotions, struggles, and imperfections.\nRespect\n– You believe in the value of your people, recognize their abilities and contributions, and treat them with dignity and courtesy.\nTrust\n– You believe your people will do the right thing because you have confidence in their honesty, integrity, and reliability.\nListening\n– You hear and decode what your people say and suggest, showing that you value their input and contributions.\nCommunication\n– You share information with your people openly, honestly, transparently and continuously.\nFeedback\n– You provide information to your people on how they’ve behaved and performed to help them grow, learn and improve.\nAppreciation\n– You show your people that you recognize, acknowledge, value and appreciate their efforts, accomplishments and contributions.\nDevelopment\n– You help your people create the best approach and plan for them to develop their abilities, learn new skills and achieve their goals.\nCoaching\n– You support and facilitate actions and activities to help your people learn, grow, discover and explore solutions to help them achieve their goals.\nEmpowerment\n– You give your people the freedom, power, control, and space to take ownership of their work.\nInspiration\n– You motivate your people by driving them towards a common purpose to achieve milestones and overcome obstacles and challenges.\nWe hope you’ve found this introduction to the Great Boss Building Block™ model helpful, something you feel could help you be a better boss. For more information and details on the model and how to use it, please check out our book ‘\nBad Bosses Ruin Lives: The Building Blocks for Being a Great Boss\n.’\nLeadership"
  },
  {
    "title": "How East Coast College gets everyone involved in recognition",
    "url": "https://www.stepituphr.com/post/how-east-coast-college-gets-everyone-involved-in-recognition",
    "published": "Tue, 26 Mar 2024 08:43:54 GMT",
    "summary": "I’m a big believer that recognition is a team sport, with every employee having a critical role to play. In my book Appreciate it! The...",
    "full_content": "How East Coast College gets everyone involved in recognition\nDebra Corey\nMar 26, 2024\n3 min read\nI’m a big believer that recognition is a team sport, with every employee having a critical role to play. In my book\nAppreciate it! The Playbook for Employee Recognition\n, I call this a ‘crowdsourcing approach’, where the team works together to create and have collective responsibility for recognition. And by doing this, all of the positive impacts of recognition are multiplied, with more eyes, ears and hearts looking for, capturing and celebrating recognition moments.\nAt East Coast College they take this to the next level by not only having their employees involved, but their students as well. And while students play a different role, they are still integral in delivering the ‘appreciation feeling’ which is oh so important.\nHere are a few examples of how East Coast College involve employees and students throughout the various elements of their recognition program:\nRecognition Cards\nThe first level of their program are recognition cards, which anyone can give to another person at any point in time. They have a range of cards (e.g. thank you cards, ‘you are a star’ cards, congratulation cards and teamwork cards) to reflect the many ways and times that appreciation can be shown. And by not limiting these to just managers, all of the everyday recognition moments are captured and celebrated.\nStar of the Month\nThe next level is their Star of the Month program, where all staff are encouraged to vote for a member of staff who has been their star of the month. Nominations can be for any reason, but they encourage them to be linked to their company values.\nThe winner gets a spin on the ‘Winner’s Wheel,’ which was made by students in their carpentry department. Prizes include an extra day of holiday, a meal for two at their onsite restaurant, free lunch in their canteen for the week or an Amazon voucher. I love that students created the wheel (how proud must they be of it!), and also that the prizes are low cost as they’re leveraging their restaurant and canteen.\nStaff Celebration\nAnother element of their program is a staff celebration that is held every year in July, and is a chance for all staff from both of their sites to get together and celebrate how amazing they all are. They have a selection of awards that are given out on the day to individuals and teams, and like the monthly award, are voted for by their staff.  In addition to awards, the event is all about having fun together, with lots of activities such as axe throwing, yoga, cake decorating, reflexology, a photo booth, an ice cream van and much more! They again had carpentry students involved, having them create a giant Jenga game which could be played. Here's a photo of one of their Chef’s after he’d been to see a media makeup students, love the beard!\nStar Performers Award Event\nThe final level of their recognition program is an annual event to celebrate what I call the ‘Best of the Best’ level, or what they call their Stars of the Year. Each department manager puts forward a member of their team to attend the event, along with an explanation as to why they were selected.  As Lynsey Wright, Development and Wellbeing Lead explained, “It’s a great way for staff to meet other winners while enjoying a meal and completing Ann’s famous quiz.”\nStudents have a large role to play with this event. Since it’s held at their onsite restaurant, students who are completing their catering qualification cook the meal, hospitality students serve the meal, and other students provide musical entertainment on arrival. And to make sure that they feel appreciated, at the end of the evening they make a big deal out of thanking them all.\nI hope this inspires you to find your own way to get your people involved in recognition. Whether it’s your leaders, managers, employees, students, etc., remember that together you have the best chance of delivering the ‘appreciation feeling.’\nPlease\ncontact me\nif you'd like to discuss how you can create innovative and effective recognition programs at your company.\nTags:\nAppreciation\nRecognition\nRecognition rewards\nRecognition"
  },
  {
    "title": "The Top 7 Myths about Bad Bosses",
    "url": "https://www.stepituphr.com/post/the-top-7-myths-about-bad-bosses",
    "published": "Thu, 21 Mar 2024 00:00:00 GMT",
    "summary": "Explore 7 myths about bad bosses, the misconceptions that get in the way of us being a great boss.",
    "full_content": "The Top 7 Myths about Bad Bosses\nDebra Corey\nMar 21, 2024\n4 min read\nThere’s no denying it: bad bosses exist. In fact, according to the survey we conducted for our book, almost everyone (99.6% of survey respondents) has had a bad boss at some point in time.\nBut why? One reason is because of the myths that exist, those misconceptions that get in the way of us being the great boss we want and need to be. Here are seven that we address and bust throughout our book (\nBad Bosses Ruin Lives: The Building Blocks for Being a Great Boss\n), highlighting them so that you and others don’t repeat them yourself.\nAll bad bosses know that they’re bad bosses\n– I’m absolutely sure that if we went to the bosses of those we surveyed, the majority would be shocked to hear that their employees thought they were a bad boss. But mathematically, that can’t be right. We\nknow\nthat bad bosses exist. This is why it’s even more important for you, as a boss, to be self-aware, understanding why, when, and how you may take on bad boss traits, and then overcome them to take actions to be a great one.\nYou’re either a bad, good, or great boss\n– When it comes to being a boss, it is never either/or, all, or nothing. We all have a mix of traits, some bad, some good, and some great. The reality is that there are shades of gray. They come and go based on the situation, the person, and even what’s happening in our lives. The key is understanding what they are and how to deal with and improve them. And keep in mind that even great bosses have bad boss traits.\nEveryone wants the same things from their boss\n– If all our people were the same, life would be easy, and being a great boss would be easy. We’d have one set of instructions to learn, and use them over and over again with our people. But that’s not how it is. Your people all want and need different things from you, and for this reason, you need to understand and adapt so that we can be a great boss to each and every one of them, whatever that looks like.\nThere are only a few skills you need to learn to be a great boss\n– Just like there is not one set of instructions, there aren’t one, two, or three skills to learn, and bang, you’re a great boss. If only! There are a wide variety of skills you need to learn so that you can handle all that your people, your business, and the world throw at you.\nOnce you get it right it’s smooth sailing\n– Wouldn’t it be great if once you finished this book, or any book, or took a course, and presto, you had what it took to be a great boss? It would, but it isn’t! And that’s because being a great boss requires introspection and feedback, commitment and devotion. It is not simple and it is not easy. And to make it even more challenging, just when you think you’ve mastered something things change, and what worked one day in one situation and with one person may not work the next day. If you want to be a great, or at least a good boss, you need to practice, and at the same time adopt a flexible and fluid attitude and approach, setting you up to ride the waves and keep on sailing.\nYou get promoted because you’re a great boss\n– Wrong, you get promoted to be a boss because you were able to do your previous job well. And though this can help you teach your people all that you’ve learned, it’s not automatically going to make you a great boss. In fact, as a new boss, you’re going to have to let go of being the person who knew everything, had all the answers, and focused on your performance. You’ll need to do things very differently going forward. As Ryan Hawk says in his book\nWelcome to Management\n,\n“Being a great manager has nothing to do with how well you performed in your old job.\n”\nBad bosses don’t ruin lives\n– Not every bad boss ruins lives, for as we’ve said, there are different degrees and levels of bad bosses. But we’ve heard the stories, we’ve had it happen to us personally, and we can say without hesitation that there are definitely bad bosses who are indeed ruining lives. They are having such a profound impact on how they’re making their people feel at work that they can’t walk away from it, shake it, or wash it off, and they bring it home. Home to their family, their friends, and their lives. As a boss, we know this is the last thing you want to do. That’s why we are on this mission to set you up for success, being a great boss who sends your people home after a rewarding day at work to have a great day and a great life.\nIf we are ever going to rid the world of bad bosses, helping each and every one of us be great, we need to bust these myths. We need to accept that there are bad boss traits in all of us,\nnot just the few\n. We need to discuss and understand our bad boss traits so that we can accept those that apply to us,\ninstead of denying that they exist\n. And we need to equip ourselves with new skills so we’re able to tackle our bad boss traits,\ninstead of trying to be a great boss using bad boss techniques and approaches\n. We need to walk into them and not away from them. Good luck!\nIf you’d like to learn more about your boss traits, good, bad and great, you can take our free online assessment test by click on this\nlink\n.\nLeadership"
  },
  {
    "title": "6 Steps for Building your Recognition Program",
    "url": "https://www.stepituphr.com/post/6-steps-for-building-your-recognition-program",
    "published": "Wed, 20 Mar 2024 08:02:21 GMT",
    "summary": "Building (or rebuilding) an employee recognition program can be one of the most rewarding things we have the pleasure of doing as HR...",
    "full_content": "6 Steps for Building your Recognition Program\nDebra Corey\nMar 20, 2024\n6 min read\nBuilding (or rebuilding) an employee recognition program can be one of the most rewarding things we have the pleasure of doing as HR professionals. But it can also be one of the most challenging, trying to get it right for both your people and your business.\nTo help you in your quest to get it right, let me share with you at a high level the six steps I use when helping companies build their programs, and which I cover in my book (\nAppreciate it! The Playbook for Employee Recognition\n).\n1. Determine your recognition objectives\nThe first step is to set your recognition strategy by determining your objectives. You do this by answering the question “why”– why do you want and need to recognize your workforce? This will give you the target to aim for as you develop your individual recognition plans. Here are four things to consider as you determine your recognition objectives:\nYour company’s mission, values and culture -\nThe starting point is to align your recognition strategy with your company’s mission, values and culture. This will help you achieve your overall vision and goals (your mission), the actions and behaviors you desire (your values), and reflect who you are as a company (your culture). Do this and all the “pieces” fit together in a cohesive picture and direction. If you don’t, there will be confusion and a lack of focus.\nYour business and people objectives -\nNext, you want to align your recognition strategy with your business and people objectives. For example, do you have objectives based around developing new products to focus your workforce on innovation? Do you have people objectives around developing stronger teams to focus your workforce on collaboration? Consider these when developing your recognition strategy so that it reinforces and drives employees to meet these objectives.\nYour business and people challenges-\nNext, it’s important to align your recognition strategy with any business and people challenges that you may have. For example, is engagement, productivity, and/or retention a problem that could be positively impacted by your recognition plan? Consider these as you develop your strategy and individual programs so that they become a strength and not a weakness.\nYour reward strategy -\nAnd finally, it’s important to align your recognition strategy with your overall reward strategy. Since recognition is just one element of your rewards, along with pay, benefits, incentives, etc., it’s critical that they all work together, completing the total rewards picture and objectives.\n2. Set your recognition principles\nNow that you’ve answered the critical “why” question, you have one more thing to do before moving on to build your recognition program, and that is to create your recognition principles. These are what help you define your program, what it stands for, what makes it unique and what it says to your employees and the external marketplace. Finding the right principles will help you create recognition plans which truly drive and support your “why,” aligning with your company’s mission, values and culture.\nYou may be wondering, what is the difference between your recognition objectives and principles? Your objectives are high-level, and your principles are the next level. Your principles need to guide the design of your recognition program so that your recognition objectives are met. They are both important, and need to be determined and set up front.\n3. Determine the number of levels\nIt’s now time to start building your recognition program, getting  into the nitty-gritty details by answering the important questions of “what,” “who” and “how.” But before you do this, you need to build the framework of your program using the recognition pyramid model I cover in my book, determining the number of levels that it will have. Think of it as a blueprint for your program – the clearer the levels are in your pyramid, the more successful it will be in helping you achieve your objectives.\nHere are high level definitions for the four levels of the recognition pyramid:\nThe “everyday” level\n– The bottom level of the pyramid, the widest part, is “everyday” recognition, and is typically given by anyone at any time for day-to-day accomplishments and achievements. For this reason, it touches the most employees as it happens the most frequently. It recognizes moments that, although important, are of\nlow impact\n, meaning they impact a small number of people and/or customers with minimal impact to them and with little extra work and effort required.\nThe “above and beyond” level\n– Here is where the pyramid starts getting a bit narrower, symbolizing how fewer employees would typically receive this type of recognition as it’s harder to reach this level of achievement. It recognizes moments that are of\nhigher impact\n, meaning where employees or teams have excelled, going above and beyond to get the job done. Think of it as a ladder, with employees needing to work that much harder to get to the next rung of the ladder, which in this case is your recognition plan.\nThe “best of the best” level\n– The top level of the pyramid symbolizes those who went above and beyond the most – often outside of their typical job role – symbolizing performing at the highest level within your organization. It recognizes moments that are of the\nhighest impact\n, having a larger or more long-term impact on a group or the business, requiring more work and effort to accomplish this. Again, think of it as a ladder, but this time think of the bell at the top that you ring when you get to the very top.\nYears of service level\n– This level of the pyramid as explained earlier sits outside of the primary levels of the pyramid, and is used to recognize employees for hitting certain key tenure milestones.\nNow before you ask me how many levels there should be in your pyramid, let me say that there is no perfect or magic number, the key here is to come up with the number of levels that will ultimately help you meet your recognition objectives. If it takes one level to do this, great! And if it’s four, that’s fine as well.\n4. Design your recognition plans\nOnce you’ve decided on your recognition levels, the next step is to design your individual recognition plans. To do this, you’ll need to determine the following for each of your recognition levels:\nDetermine the “what”\n- Start by answering the question “what,” which will help drive your reward and recognition strategy, as well as send a strong message to your employees about what is appreciated at your company, and how their contributions are valued. There are two parts to this question, which I describe as the “in” and the “out.” The “in” represents what goes into recognition, so what needs to happen to be recognized. The “out” represents what goes out of recognition, so what the person recognized will receive when they are recognized.\nDecide the “who”\n- The next question to answer is the “who,” which is when you decide who will be able to give, receive and approve recognition and recognition awards. Keep in mind that the answers to the questions may differ from recognition plan to recognition plan, which is absolutely fine as the intent and goal of the plans will differ.\nDecide the “when”\n- The final decision you’ll have to make is the “when,” which has to do with when employees will be recognized under each of your recognition plans. As with the “who,” the “when” may differ from recognition plan to recognition plan, which again is absolutely fine.\n5 – Decide how your recognition plans will work\nThe next question to answer is the “how” – how will you ensure that your recognition program and individual recognition plans deliver on your objectives once they’re in place? I want to stress that this is just as important as designing the “right” recognition program, for I’ve seen fantastic ones fail if this isn’t done well. During this step, you’ll need to answer the following four questions:\nManage\n– how will you manage and operationalize your recognition plan?\nCommunicate\n– how will you communicate your recognition plans to ensure your employees engage with them?\nTrain\n– how will you train your workforce to ensure they understand and engage with recognition?\nMeasure\n– how will you measure your recognition programs to understand if/how they are meeting your objectives?\n6 – Design your recognition branding\nThe final decisions you’ll need to make relate to the branding of your recognition program, which includes the names and designs. Although this isn’t absolutely necessary, I’ve found it to be extremely helpful in making that all-important first impression with your employees, making them decide in an instant whether they’ll engage with your recognition program or not. I actually love working on this step, as it’s where you give your hard work a meaningful and often fun personality. During this step, you’ll need to do the following:\nI hope you find these six steps helpful in building or rebuilding your recognition program and plans. Should you require further details on how to get this right, you can find them in my book (\nAppreciate it! The Playbook for Employee Recognition\n), or feel free to\ncontact me directly\n. All the best!\nTags:\nAppreciation\nRecognition\nRecognition"
  }
]